tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# .NET Core
brew "dotnet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Extendable open-source CI server
brew "jenkins-lts"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Fully functional local AWS cloud stack
brew "localstack"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tools to write and execute C#
brew "scriptcs"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Clipboard extension app
cask "clipy"
# App to build and share containerized applications and microservices
cask "docker"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Media player based on MPlayer and mplayer2
cask "mpv"
# Client-side GUI application for modern database development and operations
cask "nosql-workbench"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Flow", id: 1423210932
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
